

[
  {
    "image": "https://i.ibb.co.com/r28FM6Dp/angular.jpg",
    "title": "Angular is a modern TypeScript-based framework for building scalable, maintainable, and dynamic web applications efficiently",
    "companyName": "Google",
    "id": 1,
    "description": "Angular is a powerful front-end framework built with TypeScript, designed to help developers create scalable single-page applications. It provides a component-based structure, built-in routing, form handling, and dependency injection. With strong tooling, performance optimization, and an active community, Angular simplifies enterprise-level development. It is used widely across industries for building interactive and maintainable web platforms.",
    "size": 120,
    "reviews": 9800,
    "ratingAvg": 4.7,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 5700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HTtnxqP1/bootstrap.jpg",
    "title": "Bootstrap provides responsive front-end components for creating mobile-first and visually consistent web interfaces quickly and easily",
    "companyName": "Twitter",
    "id": 2,
    "description": "Bootstrap is a widely-used open-source CSS framework designed for creating responsive, mobile-first web designs. It includes prebuilt components such as grids, buttons, modals, and navigation bars, enabling developers to build consistent layouts quickly. Its utility classes and extensive documentation make it ideal for beginners and professionals. Bootstrap ensures design consistency across different browsers and devices with minimal effort.",
    "size": 80,
    "reviews": 8700,
    "ratingAvg": 4.6,
    "downloads": 25000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 4600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/VscDF72/chakara.jpg",
    "title": "Chakra UI delivers accessible React components with modular design for creating visually pleasing and consistent interfaces quickly",
    "companyName": "Segun Adebayo",
    "id": 3,
    "description": "Chakra UI is a modern React component library focused on accessibility, flexibility, and ease of use. It offers a set of composable and themeable UI components built with style props for quick customization. Chakra simplifies building responsive and consistent designs while maintaining accessibility standards. Developers appreciate its lightweight nature, dark mode support, and compatibility with popular React frameworks.",
    "size": 45,
    "reviews": 6200,
    "ratingAvg": 4.8,
    "downloads": 6000000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 3700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Q3ZRbqwZ/chatgpt.jpg",
    "title": "ChatGPT provides intelligent conversational experiences through advanced natural language processing powered by artificial intelligence models",
    "companyName": "OpenAI",
    "id": 4,
    "description": "ChatGPT is an advanced AI language model developed by OpenAI that generates human-like text responses in conversation. It can assist with coding, writing, learning, and automation tasks. ChatGPT understands context, maintains dialogue flow, and produces detailed, creative answers. Its capabilities are integrated into applications, websites, and APIs, transforming the way users interact with digital systems.",
    "size": 300,
    "reviews": 15000,
    "ratingAvg": 4.9,
    "downloads": 50000000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 11000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Q390SJjT/dasiui.jpg",
    "title": "DaisyUI extends Tailwind CSS with prebuilt components to create beautiful interfaces faster and with minimal custom styling",
    "companyName": "DaisyUI Community",
    "id": 5,
    "description": "DaisyUI is a Tailwind CSS plugin that adds ready-to-use UI components like buttons, modals, cards, and alerts. It simplifies front-end development by reducing repetitive styling work. DaisyUI promotes consistency, supports themes, and integrates seamlessly with Tailwind’s utility-first approach. Its customization options and light/dark modes make it a favorite among modern developers creating responsive web applications.",
    "size": 35,
    "reviews": 5600,
    "ratingAvg": 4.8,
    "downloads": 4500000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 3350 }
    ]
  },
   {
    "image": "https://i.ibb.co.com/QvN9WT1F/figma.png",
    "title": "Figma is a cloud-based design tool that allows collaborative interface, prototyping, and vector design work seamlessly online",
    "companyName": "Figma Inc",
    "id": 6,
    "description": "Figma is a popular cloud-based interface design and prototyping tool used for creating UI/UX designs collaboratively. It allows multiple users to edit and comment in real time, making teamwork seamless. Figma supports vector graphics, interactive prototyping, and plugin integrations, enabling designers and developers to streamline workflows. Its cross-platform nature eliminates compatibility issues and improves productivity for web and mobile projects.",
    "size": 90,
    "reviews": 8200,
    "ratingAvg": 4.8,
    "downloads": 8000000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 2200 },
      { "name": "5 star", "count": 5000 }
    ]
  },
  {
    "image": " https://i.ibb.co.com/DPgZj7jK/firebase1.jpg",
    "title": "Firebase provides a complete suite of cloud-based backend services for building scalable web and mobile applications efficiently",
    "companyName": "Google",
    "id": 7,
    "description": "Firebase is a comprehensive cloud-based platform that helps developers build web and mobile applications quickly. It offers services like real-time databases, authentication, hosting, cloud storage, and analytics. Firebase simplifies backend development, scales automatically, and integrates seamlessly with other Google services. Its SDKs support multiple platforms, making it a preferred choice for developers who want fast deployment, live data updates, and efficient app monitoring.",
    "size": 200,
    "reviews": 11200,
    "ratingAvg": 4.7,
    "downloads": 20000000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 6600 }
    ]
  },
  {
    "image": " https://i.ibb.co.com/MDrHhvYR/github.jpg",
    "title": "GitHub is a web-based platform for version control, collaboration, and source code management using Git repositories effectively",
    "companyName": "GitHub Inc",
    "id": 8,
    "description": "GitHub is the leading platform for software development, version control, and collaborative coding using Git repositories. It allows developers to host, review, and manage code efficiently. GitHub supports pull requests, issues tracking, CI/CD workflows, and collaborative project management. Its open-source ecosystem enables communities to contribute to projects globally. Developers leverage GitHub to ensure code quality, maintain history, and streamline team collaboration across multiple projects.",
    "size": 50,
    "reviews": 15000,
    "ratingAvg": 4.9,
    "downloads": 40000000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 10700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/60rHs6WS/material.png",
    "title": "Material UI provides a set of customizable React components following Google’s Material Design system for seamless user interfaces",
    "companyName": "MUI Team",
    "id": 9,
    "description": "Material UI is a popular React component library implementing Google’s Material Design guidelines. It provides prebuilt, customizable UI components such as buttons, forms, tables, and dialogs. Material UI allows developers to create visually consistent and responsive web applications quickly. It offers theme support, accessibility features, and integration with React’s ecosystem. The library reduces development time while maintaining modern and polished user interfaces for web projects.",
    "size": 60,
    "reviews": 7300,
    "ratingAvg": 4.8,
    "downloads": 9000000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 4200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YTLxtvs6/mongodb.png",
    "title": "MongoDB is a scalable NoSQL database that stores flexible JSON-like documents for high-performance modern web and mobile applications",
    "companyName": "MongoDB Inc",
    "id": 10,
    "description": "MongoDB is a leading NoSQL database designed for high-performance, flexible, and scalable data storage. It stores data in JSON-like documents, allowing dynamic schemas and easy integration with modern applications. MongoDB supports rich queries, indexing, aggregation, and horizontal scaling. Its flexible structure and cloud offerings make it ideal for web, mobile, and enterprise applications. Developers rely on MongoDB for fast access, reliability, and robust analytics.",
    "size": 150,
    "reviews": 10500,
    "ratingAvg": 4.7,
    "downloads": 15000000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 6300 }
    ]
  },

  {
    "image": " https://i.ibb.co.com/XZkkmhX2/images.jpg",
    "title": "Tailwind CSS is a utility-first CSS framework that allows developers to rapidly build custom and responsive designs efficiently",
    "companyName": "Tailwind Labs",
    "id": 11,
    "description": "Tailwind CSS is a modern utility-first CSS framework that provides low-level classes for building custom designs without leaving HTML. It allows developers to create responsive layouts quickly and maintain design consistency across applications. With a highly customizable configuration, built-in plugins, and easy integration with frameworks like React and Vue, Tailwind CSS significantly speeds up front-end development workflows while keeping code maintainable.",
    "size": 55,
    "reviews": 9000,
    "ratingAvg": 4.8,
    "downloads": 12000000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 5600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/kVhvX6DX/motion.jpg",
    "title": "Framer Motion is a powerful React animation library for creating smooth, interactive, and visually engaging motion effects seamlessly",
    "companyName": "Framer",
    "id": 12,
    "description": "Framer Motion is a popular React library used for creating declarative and fluid animations in web applications. It provides an easy-to-use API for complex animations, gestures, and interactive effects. Developers can animate components, transitions, and layouts effortlessly while maintaining high performance. With Framer Motion, web interfaces become more engaging and dynamic, improving user experience and enhancing overall application design.",
    "size": 40,
    "reviews": 5800,
    "ratingAvg": 4.9,
    "downloads": 7000000,
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 3520 }
    ]
  },
  {
    "image": " https://i.ibb.co.com/W40qyZZt/netlify.jpg",
    "title": "Netlify is a cloud-based platform that automates web deployment, hosting, and continuous integration for modern static sites effectively",
    "companyName": "Netlify Inc",
    "id": 13,
    "description": "Netlify is a cloud platform for deploying and hosting static websites and serverless functions. It offers continuous deployment from Git repositories, automated builds, global CDN hosting, and advanced analytics. Developers use Netlify to streamline their workflow, deploy websites instantly, and scale applications efficiently. Its integration with Jamstack architecture and modern front-end frameworks makes it a preferred choice for fast, reliable, and secure web hosting.",
    "size": 35,
    "reviews": 6700,
    "ratingAvg": 4.7,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 4050 }
    ]
  },
  {
    "image": " https://i.ibb.co.com/BHj8t8WW/next.jpg",
    "title": "Next.js is a React framework that enables server-side rendering, static site generation, and optimized performance for scalable web apps",
    "companyName": "Vercel",
    "id": 14,
    "description": "Next.js is a powerful React framework designed for server-side rendering, static site generation, and building high-performance web applications. It offers built-in routing, API routes, and optimization features such as automatic code splitting and image handling. Developers can create SEO-friendly, fast-loading websites with minimal configuration. Next.js is widely adopted for production-ready applications due to its flexibility, reliability, and seamless integration with modern front-end tools.",
    "size": 90,
    "reviews": 8800,
    "ratingAvg": 4.8,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 4200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LXFQszVp/node.jpg",
    "title": "Node.js is an open-source runtime environment that executes JavaScript on servers and enables building scalable backend applications efficiently",
    "companyName": "OpenJS Foundation",
    "id": 15,
    "description": "Node.js is a powerful JavaScript runtime environment that allows developers to run JavaScript code on the server-side. It supports non-blocking, event-driven architecture, making it ideal for scalable and high-performance web applications. Node.js has a rich ecosystem of libraries through npm and can handle real-time applications, APIs, and microservices effectively. Its cross-platform capabilities make it a cornerstone of modern full-stack development.",
    "size": 150,
    "reviews": 14000,
    "ratingAvg": 4.9,
    "downloads": 30000000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 9000 }
    ]
  },
  {
    "image": " https://i.ibb.co.com/yBfb7syJ/pisixo.jpg",
    "title": "Pisixo is a modern design and development tool that helps teams collaborate efficiently on web and app interface projects quickly",
    "companyName": "Pisixo Inc",
    "id": 16,
    "description": "Pisixo is a collaborative web and app interface design tool that allows designers and developers to work together efficiently. It provides features for prototyping, design versioning, and project management. Pisixo supports cross-platform compatibility, real-time updates, and easy sharing of design assets. With intuitive tools and seamless workflow integration, teams can create interactive, responsive, and visually appealing applications faster than traditional methods.",
    "size": 85,
    "reviews": 4300,
    "ratingAvg": 4.6,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 2250 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MxBDfGRm/reacticon.jpg",
    "title": "React Icons provides a large collection of popular icon sets for React applications to enhance UI design and improve usability quickly",
    "companyName": "React Community",
    "id": 17,
    "description": "React Icons is a popular library that allows developers to easily use thousands of icons from multiple icon sets in React applications. It supports FontAwesome, Material Design, and other collections. The library simplifies the integration of icons, providing scalable, customizable, and accessible icons for web projects. React Icons improves user interfaces, accelerates development, and ensures consistency across application design.",
    "size": 25,
    "reviews": 5600,
    "ratingAvg": 4.8,
    "downloads": 8000000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 3170 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xq86rr05/vercell.png",
    "title": "Vercel is a cloud platform for hosting modern web projects with seamless deployment, global CDN, and serverless backend support effectively",
    "companyName": "Vercel Inc",
    "id": 18,
    "description": "Vercel is a cloud platform that specializes in hosting and deploying modern web applications. It offers continuous deployment from Git repositories, serverless functions, global CDN hosting, and analytics. Vercel integrates well with frameworks like Next.js and React, simplifying web development workflows. Its automated builds, fast performance, and scalability make it ideal for professional developers and teams aiming for high-quality, production-ready applications quickly.",
    "size": 40,
    "reviews": 7100,
    "ratingAvg": 4.7,
    "downloads": 9000000,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 3090 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/J18KfwH/vite.jpg",
    "title": "Vite is a fast, modern build tool that provides instant hot module replacement and optimized bundling for web development projects",
    "companyName": "Evan You",
    "id": 19,
    "description": "Vite is a next-generation frontend build tool that focuses on speed and performance. It provides instant hot module replacement (HMR), fast cold starts, and optimized bundling for production builds. Vite supports modern JavaScript frameworks like Vue, React, and Svelte, improving developer experience with minimal configuration. Its architecture enhances build times, productivity, and ensures efficient workflow management for web projects of all sizes.",
    "size": 35,
    "reviews": 6500,
    "ratingAvg": 4.8,
    "downloads": 6000000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2050 }
    ]
  },
  {
    "image": " https://i.ibb.co.com/XrZHBnVf/vue.png",
    "title": "Vue.js is a progressive JavaScript framework for building interactive user interfaces and single-page applications efficiently with simplicity",
    "companyName": "Evan You",
    "id": 20,
    "description": "Vue.js is a progressive JavaScript framework that allows developers to build interactive user interfaces and single-page applications easily. It features a component-based architecture, reactive data binding, and a flexible ecosystem including Vue Router and Vuex. Vue.js simplifies front-end development while maintaining performance and scalability. Its simplicity, documentation, and community support make it ideal for beginners and professionals alike for modern web development.",
    "size": 80,
    "reviews": 10200,
    "ratingAvg": 4.8,
    "downloads": 14000000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 6420 }
    ]
  }
]





